app/views/books/_index1.html.erb

        <td><%= book.body %></td>
        <td><%= book.book_comments.count %>comment</td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]