app/views/searches/search.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE'j%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        <td><%= render 'favorites/favorite', book: book %></td>
        <td>コメント件数：<%= book.book_comments.count %></td>