app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hihhihihihi"], ["body", "gugugugugu"], ["user_id", 5], ["created_at", "2021-02-09 02:42:22.516438"], ["updated_at", "2021-02-09 02:42:22.516438"]]
SELECT "books".* FROM "books"

  def   ensure_correct_user
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]