app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["user_id", 1], ["created_at", "2021-02-06 06:53:36.576849"], ["updated_at", "2021-02-06 06:53:36.576849"]]
---
    def create
    favorite = current_user.favorites.new(book_id: @book.id)
    favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
    def destroy
    favorite = current_user.favorites.find_by(book_id: @book.id)
    favorite.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:book_id])