app/controllers/relationships_controller.rb

    def create
    user = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def destroy
      user = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."followed_id" = ? LIMIT ?  [["followed_id", 4], ["followed_id", 1], ["LIMIT", 1]]

    def set_user
      @user = User.find(params[:follow_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]