app/models/user.rb

INSERT INTO "relationships" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 1], ["follower_id", 4], ["created_at", "2021-02-08 08:24:57.456834"], ["updated_at", "2021-02-08 08:24:57.456834"]]
---
  def follow(other_user)
    unless self == other_user
      self.active_relationships.create(followed_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."followed_id" = ? LIMIT ?  [["followed_id", 4], ["followed_id", 1], ["LIMIT", 1]]
---
  def unfollow(user_id)
    # binding.pry ↓find byはフォローされているユーザの誰が解除するかを
     self.passive_relationships.find_by(followed_id: user_id).destroy

SELECT "users".* FROM "users"
---
  def following?(other_user)
    self.followings.include?(other_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def favorited_by?(user)
    favorites.where(user_id: user.id).exists?